(function() {
	
$.extend($.RegexpMask.rules, {
	'minuteExpression': {
		mask:/^((\d|[1-5]\d)((-(\d|[1-5]\d))?|(,(\d|[1-5]\d))*)|(\d\/([1-9]|[1-5]\d)))$/,
		chars:/[(\d)\-,\/]/,
		message: '请输入类似0-59(表示0-59分),或1,3,5(表示1,3,5分)或0/5(表示从0分开始每2分钟)的有效天数值'
	},	
	'hourExpression': {
		mask:/^((\d|1\d|2[0-3])((-(\d|1\d|2[0-3]))?|(,(\d|1\d|2[0-3]))*)|(\d\/([1-9]|1\d|2[0-3])))$/,
		chars:/[(\d)\-,\/]/,
		message: '请输入类似0-23(表示0至23时),或1,3,5(表示1,3,5时)或8/2(表示从8时开始每2小时)的有效小时数值'
	},	
	'dayExpression': {
		mask:/^(([1-9]|[12]\d|3[01])((-([1-9]|[12]\d|3[01]))?|(,([1-9]|[12]\d|3[01]))*)|([1-9]\/([1-9]|[12]\d|30))|L)$/,
		chars:/[(\d)\-,\/L]/,
		message: '请输入类似1-31(表示1至31日),或1,3,5(表示1,3,5日)或8/2(表示从8日开始每2天)或L(表示月最后1天)的有效天数值'
	},
	'weekExpression': {
		mask:/^[1-7]((-[1-7])?|(,[1-7])*)$/,
		chars:/[1-7\-,]/,
		message: '请输入类似1-7(表示周日至周六),或1,3,5(表示周日,周二,周四)的有效星期值'		
	},
	'monthExpression': {
		mask:/^([1-9]|1[0-2])((-([1-9]|1[0-2]))?|(,([1-9]|1[0-2]))*)$/,
		chars:/[(\d)\-,]/,
		message: '请输入类似1-12(表示1至12月),或1,3,5(表示1,3,5月)的有效月份值'		
	},
	'yearExpression': {
		mask:/^(20(\d){2})((-(20(\d){2}))?|(,(20(\d){2}))*)$/,
		chars:/[(\d)\-,]/,
		message: '请输入类似2010-2088,或2012,2013的有效年份值'
	}
});	
	
})(jQuery);